/* automatically generated by rust-bindgen 0.72.1 */

pub type lkPlatformImageBuffer = ::std::os::raw::c_void;
pub type lkRefCountedObject = ::std::os::raw::c_void;
pub type lkString = lkRefCountedObject;
pub type lkData = lkRefCountedObject;
pub type lkVectorGeneric = lkRefCountedObject;
pub type lkPeerFactory = lkRefCountedObject;
pub type lkPeer = lkRefCountedObject;
pub type lkDataChannel = lkRefCountedObject;
pub type lkRtpTransceiver = lkRefCountedObject;
pub type lkRtpReceiver = lkRefCountedObject;
pub type lkRtpSender = lkRefCountedObject;
pub type lkMediaStreamTrack = lkRefCountedObject;
pub type lkMediaStream = lkRefCountedObject;
pub type lkSessionDescription = lkRefCountedObject;
pub type lkIceCandidate = lkRefCountedObject;
pub type lkRtpCapabilities = lkRefCountedObject;
pub type lkRtcVideoTrack = lkRefCountedObject;
pub type lkRtcAudioTrack = lkRefCountedObject;
pub type lkVideoTrackSource = lkRefCountedObject;
pub type lkAudioTrackSource = lkRefCountedObject;
pub type lkNativeAudioSink = lkRefCountedObject;
pub type lkNativeAudioStream = lkRefCountedObject;
pub type lkVideoFrame = lkRefCountedObject;
pub type lkVideoFrameBuffer = lkRefCountedObject;
pub type lkPlanarYuvBuffer = lkRefCountedObject;
pub type lkPlanarYuv8Buffer = lkRefCountedObject;
pub type lkBiplanarYuvBuffer = lkRefCountedObject;
pub type lkPlanarYuv16BBuffer = lkRefCountedObject;
pub type lkBiplanarYuv8Buffer = lkRefCountedObject;
pub type lkI420Buffer = lkRefCountedObject;

    LK_ICE_GATHERING_NEW = 0,
    LK_ICE_GATHERING_GATHERING = 1,
    LK_ICE_GATHERING_COMPLETE = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkSdpType {
    LK_SDP_TYPE_OFFER = 0,
    LK_SDP_TYPE_PRANSWER = 1,
    LK_SDP_TYPE_ANSWER = 2,
    LK_SDP_TYPE_ROLLBACK = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkDcState {
    LK_DC_STATE_CONNECTING = 0,
    LK_DC_STATE_OPEN = 1,
    LK_DC_STATE_CLOSING = 2,
    LK_DC_STATE_CLOSED = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkRtcTrackState {
    LK_RTC_TRACK_STATE_LIVE = 0,
    LK_RTC_TRACK_STATE_ENDED = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkMediaStreamTrackKind {
    LK_MEDIA_STREAM_TRACK_KIND_AUDIO = 0,
    LK_MEDIA_STREAM_TRACK_KIND_VIDEO = 1,
    LK_MEDIA_STREAM_TRACK_KIND_DATA = 2,
    LK_MEDIA_STREAM_TRACK_KIND_UNKNOWN = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkPeerObserver {
    pub onSignalingChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkSignalingState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onIceCandidate: ::std::option::Option<
        unsafe extern "C" fn(candidate: *mut lkIceCandidate, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onDataChannel: ::std::option::Option<
        unsafe extern "C" fn(dc: *const lkDataChannel, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onTrack: ::std::option::Option<
        unsafe extern "C" fn(
            transceiver: *const lkRtpTransceiver,
            receiver: *const lkRtpReceiver,
            streams: *const lkVectorGeneric,
            track: *const lkMediaStreamTrack,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onRemoveTrack: ::std::option::Option<
        unsafe extern "C" fn(receiver: *const lkRtpReceiver, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onConnectionChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkPeerState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onStandardizedIceConnectionChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkIceState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onIceGatheringChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkIceGatheringState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onRenegotiationNeeded:
        ::std::option::Option<unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void)>,
    pub onIceCandidateError: ::std::option::Option<
        unsafe extern "C" fn(
            address: *const ::std::os::raw::c_char,
            port: ::std::os::raw::c_int,
            url: *const ::std::os::raw::c_char,
            error_code: ::std::os::raw::c_int,
            error_text: *const ::std::os::raw::c_char,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkPeerObserver"][::std::mem::size_of::<lkPeerObserver>() - 80usize];
    ["Alignment of lkPeerObserver"][::std::mem::align_of::<lkPeerObserver>() - 8usize];
    ["Offset of field: lkPeerObserver::onSignalingChange"]
        [::std::mem::offset_of!(lkPeerObserver, onSignalingChange) - 0usize];
    ["Offset of field: lkPeerObserver::onIceCandidate"]
        [::std::mem::offset_of!(lkPeerObserver, onIceCandidate) - 8usize];
    ["Offset of field: lkPeerObserver::onDataChannel"]
        [::std::mem::offset_of!(lkPeerObserver, onDataChannel) - 16usize];
    ["Offset of field: lkPeerObserver::onTrack"]
        [::std::mem::offset_of!(lkPeerObserver, onTrack) - 24usize];
    ["Offset of field: lkPeerObserver::onRemoveTrack"]
        [::std::mem::offset_of!(lkPeerObserver, onRemoveTrack) - 32usize];
    ["Offset of field: lkPeerObserver::onConnectionChange"]
        [::std::mem::offset_of!(lkPeerObserver, onConnectionChange) - 40usize];
    ["Offset of field: lkPeerObserver::onStandardizedIceConnectionChange"]
        [::std::mem::offset_of!(lkPeerObserver, onStandardizedIceConnectionChange) - 48usize];
    ["Offset of field: lkPeerObserver::onIceGatheringChange"]
        [::std::mem::offset_of!(lkPeerObserver, onIceGatheringChange) - 56usize];
    ["Offset of field: lkPeerObserver::onRenegotiationNeeded"]
        [::std::mem::offset_of!(lkPeerObserver, onRenegotiationNeeded) - 64usize];
    ["Offset of field: lkPeerObserver::onIceCandidateError"]
        [::std::mem::offset_of!(lkPeerObserver, onIceCandidateError) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkDataChannelObserver {
    pub onStateChange: ::std::option::Option<
        unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void, state: lkDcState),
    >,
    pub onMessage: ::std::option::Option<
        unsafe extern "C" fn(
            data: *const u8,
            size: u64,
            binary: bool,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onBufferedAmountChange: ::std::option::Option<
        unsafe extern "C" fn(sentDataSize: u64, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkDataChannelObserver"][::std::mem::size_of::<lkDataChannelObserver>() - 24usize];
    ["Alignment of lkDataChannelObserver"]
        [::std::mem::align_of::<lkDataChannelObserver>() - 8usize];
    ["Offset of field: lkDataChannelObserver::onStateChange"]
        [::std::mem::offset_of!(lkDataChannelObserver, onStateChange) - 0usize];
    ["Offset of field: lkDataChannelObserver::onMessage"]
        [::std::mem::offset_of!(lkDataChannelObserver, onMessage) - 8usize];
    ["Offset of field: lkDataChannelObserver::onBufferedAmountChange"]
        [::std::mem::offset_of!(lkDataChannelObserver, onBufferedAmountChange) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkIceServer {
    pub urls: *mut *const ::std::os::raw::c_char,
    pub urlsCount: ::std::os::raw::c_int,
    pub username: *const ::std::os::raw::c_char,
    pub password: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkIceServer"][::std::mem::size_of::<lkIceServer>() - 32usize];
    ["Alignment of lkIceServer"][::std::mem::align_of::<lkIceServer>() - 8usize];
    ["Offset of field: lkIceServer::urls"][::std::mem::offset_of!(lkIceServer, urls) - 0usize];
    ["Offset of field: lkIceServer::urlsCount"]
        [::std::mem::offset_of!(lkIceServer, urlsCount) - 8usize];
    ["Offset of field: lkIceServer::username"]
        [::std::mem::offset_of!(lkIceServer, username) - 16usize];
    ["Offset of field: lkIceServer::password"]
        [::std::mem::offset_of!(lkIceServer, password) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkRtcConfiguration {
    pub iceServers: *mut lkIceServer,
    pub iceServersCount: ::std::os::raw::c_int,
    pub iceTransportType: lkIceTransportType,
    pub gatheringPolicy: lkContinualGatheringPolicy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkRtcConfiguration"][::std::mem::size_of::<lkRtcConfiguration>() - 24usize];
    ["Alignment of lkRtcConfiguration"][::std::mem::align_of::<lkRtcConfiguration>() - 8usize];
    ["Offset of field: lkRtcConfiguration::iceServers"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceServers) - 0usize];
    ["Offset of field: lkRtcConfiguration::iceServersCount"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceServersCount) - 8usize];
    ["Offset of field: lkRtcConfiguration::iceTransportType"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceTransportType) - 12usize];
    ["Offset of field: lkRtcConfiguration::gatheringPolicy"]
        [::std::mem::offset_of!(lkRtcConfiguration, gatheringPolicy) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkDataChannelInit {
    pub reliable: bool,
    pub ordered: bool,
    pub maxRetransmits: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkDataChannelInit"][::std::mem::size_of::<lkDataChannelInit>() - 8usize];
    ["Alignment of lkDataChannelInit"][::std::mem::align_of::<lkDataChannelInit>() - 4usize];
    ["Offset of field: lkDataChannelInit::reliable"]
        [::std::mem::offset_of!(lkDataChannelInit, reliable) - 0usize];
    ["Offset of field: lkDataChannelInit::ordered"]
        [::std::mem::offset_of!(lkDataChannelInit, ordered) - 1usize];
    ["Offset of field: lkDataChannelInit::maxRetransmits"]
        [::std::mem::offset_of!(lkDataChannelInit, maxRetransmits) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkRtcError {
    pub message: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkRtcError"][::std::mem::size_of::<lkRtcError>() - 8usize];
    ["Alignment of lkRtcError"][::std::mem::align_of::<lkRtcError>() - 8usize];
    ["Offset of field: lkRtcError::message"][::std::mem::offset_of!(lkRtcError, message) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkStringOut {
    pub buf: *const ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkStringOut"][::std::mem::size_of::<lkStringOut>() - 16usize];
    ["Alignment of lkStringOut"][::std::mem::align_of::<lkStringOut>() - 8usize];
    ["Offset of field: lkStringOut::buf"][::std::mem::offset_of!(lkStringOut, buf) - 0usize];
    ["Offset of field: lkStringOut::length"][::std::mem::offset_of!(lkStringOut, length) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkSetSdpObserver {
    pub onSuccess:
        ::std::option::Option<unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void)>,
    pub onFailure: ::std::option::Option<
        unsafe extern "C" fn(error: *const lkRtcError, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkSetSdpObserver"][::std::mem::size_of::<lkSetSdpObserver>() - 16usize];
    ["Alignment of lkSetSdpObserver"][::std::mem::align_of::<lkSetSdpObserver>() - 8usize];
    ["Offset of field: lkSetSdpObserver::onSuccess"]
        [::std::mem::offset_of!(lkSetSdpObserver, onSuccess) - 0usize];
    ["Offset of field: lkSetSdpObserver::onFailure"]
        [::std::mem::offset_of!(lkSetSdpObserver, onFailure) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkCreateSdpObserver {
    pub onSuccess: ::std::option::Option<
        unsafe extern "C" fn(
            desc: *mut lkSessionDescription,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onFailure: ::std::option::Option<
        unsafe extern "C" fn(error: *const lkRtcError, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkCreateSdpObserver"][::std::mem::size_of::<lkCreateSdpObserver>() - 16usize];
    ["Alignment of lkCreateSdpObserver"][::std::mem::align_of::<lkCreateSdpObserver>() - 8usize];
    ["Offset of field: lkCreateSdpObserver::onSuccess"]
        [::std::mem::offset_of!(lkCreateSdpObserver, onSuccess) - 0usize];
    ["Offset of field: lkCreateSdpObserver::onFailure"]
        [::std::mem::offset_of!(lkCreateSdpObserver, onFailure) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkOfferAnswerOptions {
    pub iceRestart: bool,
    pub useRtpMux: bool,
    pub offerToReceiveAudio: bool,
    pub offerToReceiveVideo: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkOfferAnswerOptions"][::std::mem::size_of::<lkOfferAnswerOptions>() - 4usize];
    ["Alignment of lkOfferAnswerOptions"][::std::mem::align_of::<lkOfferAnswerOptions>() - 1usize];
    ["Offset of field: lkOfferAnswerOptions::iceRestart"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, iceRestart) - 0usize];
    ["Offset of field: lkOfferAnswerOptions::useRtpMux"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, useRtpMux) - 1usize];
    ["Offset of field: lkOfferAnswerOptions::offerToReceiveAudio"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, offerToReceiveAudio) - 2usize];
    ["Offset of field: lkOfferAnswerOptions::offerToReceiveVideo"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, offerToReceiveVideo) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkAudioSourceOptions {
    pub echoCancellation: bool,
    pub noiseSuppression: bool,
    pub autoGainControl: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkAudioSourceOptions"][::std::mem::size_of::<lkAudioSourceOptions>() - 3usize];
    ["Alignment of lkAudioSourceOptions"][::std::mem::align_of::<lkAudioSourceOptions>() - 1usize];
    ["Offset of field: lkAudioSourceOptions::echoCancellation"]
        [::std::mem::offset_of!(lkAudioSourceOptions, echoCancellation) - 0usize];
    ["Offset of field: lkAudioSourceOptions::noiseSuppression"]
        [::std::mem::offset_of!(lkAudioSourceOptions, noiseSuppression) - 1usize];
    ["Offset of field: lkAudioSourceOptions::autoGainControl"]
        [::std::mem::offset_of!(lkAudioSourceOptions, autoGainControl) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkVideoResolution {
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkVideoResolution"][::std::mem::size_of::<lkVideoResolution>() - 8usize];
    ["Alignment of lkVideoResolution"][::std::mem::align_of::<lkVideoResolution>() - 4usize];
    ["Offset of field: lkVideoResolution::width"]
        [::std::mem::offset_of!(lkVideoResolution, width) - 0usize];
    ["Offset of field: lkVideoResolution::height"]
        [::std::mem::offset_of!(lkVideoResolution, height) - 4usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkContentHint {
    LK_CONTENT_HINT_NONE = 0,
    LK_CONTENT_HINT_FLUID = 1,
    LK_CONTENT_HINT_DETAILed = 2,
    LK_CONTENT_HINT_TEXT = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkVideoTrackSourceConstraints {
    pub minFps: f64,
    pub maxFps: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkVideoTrackSourceConstraints"]
        [::std::mem::size_of::<lkVideoTrackSourceConstraints>() - 16usize];
    ["Alignment of lkVideoTrackSourceConstraints"]
        [::std::mem::align_of::<lkVideoTrackSourceConstraints>() - 8usize];
    ["Offset of field: lkVideoTrackSourceConstraints::minFps"]
        [::std::mem::offset_of!(lkVideoTrackSourceConstraints, minFps) - 0usize];
    ["Offset of field: lkVideoTrackSourceConstraints::maxFps"]
        [::std::mem::offset_of!(lkVideoTrackSourceConstraints, maxFps) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkVideoSinkCallabacks {
    pub onFrame: ::std::option::Option<
        unsafe extern "C" fn(frame: *const lkVideoFrame, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onDiscardedFrame:
        ::std::option::Option<unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void)>,
    pub onConstraintsChanged: ::std::option::Option<
        unsafe extern "C" fn(
            resolution: *mut lkVideoTrackSourceConstraints,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkVideoSinkCallabacks"][::std::mem::size_of::<lkVideoSinkCallabacks>() - 24usize];
    ["Alignment of lkVideoSinkCallabacks"]
        [::std::mem::align_of::<lkVideoSinkCallabacks>() - 8usize];
    ["Offset of field: lkVideoSinkCallabacks::onFrame"]
        [::std::mem::offset_of!(lkVideoSinkCallabacks, onFrame) - 0usize];
    ["Offset of field: lkVideoSinkCallabacks::onDiscardedFrame"]
        [::std::mem::offset_of!(lkVideoSinkCallabacks, onDiscardedFrame) - 8usize];
    ["Offset of field: lkVideoSinkCallabacks::onConstraintsChanged"]
        [::std::mem::offset_of!(lkVideoSinkCallabacks, onConstraintsChanged) - 16usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkVideoBufferType {
    LK_VIDEO_BUFFER_TYPE_NATIVE = 0,
    LK_VIDEO_BUFFER_TYPE_I420 = 1,
    LK_VIDEO_BUFFER_TYPE_I420A = 2,
    LK_VIDEO_BUFFER_TYPE_I422 = 3,
    LK_VIDEO_BUFFER_TYPE_I444 = 4,
    LK_VIDEO_BUFFER_TYPE_I010 = 5,
    LK_VIDEO_BUFFER_TYPE_NV12 = 6,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkVideoRotation {
    LK_VIDEO_ROTATION_0 = 0,
    LK_VIDEO_ROTATION_90 = 1,
    LK_VIDEO_ROTATION_180 = 2,
    LK_VIDEO_ROTATION_270 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkRtpTransceiverDirection {
    LK_RTP_TRANSCEIVER_DIRECTION_SENDRECV = 0,
    LK_RTP_TRANSCEIVER_DIRECTION_SENDONLY = 1,
    LK_RTP_TRANSCEIVER_DIRECTION_RECVONLY = 2,
