/* automatically generated by rust-bindgen 0.72.1 */

pub type lkRefCounted = ::std::os::raw::c_void;
pub type lkPeerFactory = ::std::os::raw::c_void;
pub type lkPeer = ::std::os::raw::c_void;
pub type lkDataChannel = ::std::os::raw::c_void;
pub type lkRtpTransceiver = ::std::os::raw::c_void;
pub type lkRtpReceiver = ::std::os::raw::c_void;
pub type lkRtpSender = ::std::os::raw::c_void;
pub type lkMediaStreamTrack = ::std::os::raw::c_void;
pub type lkMediaStream = ::std::os::raw::c_void;
pub type lkSessionDescription = ::std::os::raw::c_void;
pub type lkIceCandidate = ::std::os::raw::c_void;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkIceTransportType {
    LK_ICE_TRANSPORT_TYPE_NONE = 0,
    LK_ICE_TRANSPORT_TYPE_RELAY = 1,
    LK_ICE_TRANSPORT_TYPE_NO_HOST = 2,
    LK_ICE_TRANSPORT_TYPE_ALL = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkContinualGatheringPolicy {
    LK_GATHERING_POLICY_ONCE = 0,
    LK_GATHERING_POLICY_CONTINUALLY = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkPeerState {
    LK_PEER_STATE_NEW = 0,
    LK_PEER_STATE_CONNECTING = 1,
    LK_PEER_STATE_CONNECTED = 2,
    LK_PEER_STATE_DISCONNECTED = 3,
    LK_PEER_STATE_FAILED = 4,
    LK_PEER_STATE_CLOSED = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkSignalingState {
    LK_SIGNALING_STATE_STABLE = 0,
    LK_SIGNALING_STATE_HAVE_LOCAL_OFFER = 1,
    LK_SIGNALING_STATE_HAVE_LOCAL_PRANSWER = 2,
    LK_SIGNALING_STATE_HAVE_REMOTE_OFFER = 3,
    LK_SIGNALING_STATE_HAVE_REMOTE_PRANSWER = 4,
    LK_SIGNALING_STATE_CLOSED = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkIceState {
    LK_ICE_STATE_NEW = 0,
    LK_ICE_STATE_CHECKING = 1,
    LK_ICE_STATE_CONNECTED = 2,
    LK_ICE_STATE_COMPLETED = 3,
    LK_ICE_STATE_FAILED = 4,
    LK_ICE_STATE_DISCONNECTED = 5,
    LK_ICE_STATE_CLOSED = 6,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkIceGatheringState {
    LK_ICE_GATHERING_NEW = 0,
    LK_ICE_GATHERING_GATHERING = 1,
    LK_ICE_GATHERING_COMPLETE = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkSdpType {
    LK_SDP_TYPE_OFFER = 0,
    LK_SDP_TYPE_PRANSWER = 1,
    LK_SDP_TYPE_ANSWER = 2,
    LK_SDP_TYPE_ROLLBACK = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum lkDcState {
    LK_DC_STATE_CONNECTING = 0,
    LK_DC_STATE_OPEN = 1,
    LK_DC_STATE_CLOSING = 2,
    LK_DC_STATE_CLOSED = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkPeerObserver {
    pub onSignalingChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkSignalingState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onIceCandidate: ::std::option::Option<
        unsafe extern "C" fn(candidate: *mut lkIceCandidate, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onDataChannel: ::std::option::Option<
        unsafe extern "C" fn(dc: *const lkDataChannel, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onTrack: ::std::option::Option<
        unsafe extern "C" fn(
            transceiver: *const lkRtpTransceiver,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onConnectionChange: ::std::option::Option<
        unsafe extern "C" fn(state: lkPeerState, userdata: *mut ::std::os::raw::c_void),
    >,
    pub onIceCandidateError: ::std::option::Option<
        unsafe extern "C" fn(
            address: *const ::std::os::raw::c_char,
            port: ::std::os::raw::c_int,
            url: *const ::std::os::raw::c_char,
            error_code: ::std::os::raw::c_int,
            error_text: *const ::std::os::raw::c_char,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkPeerObserver"][::std::mem::size_of::<lkPeerObserver>() - 48usize];
    ["Alignment of lkPeerObserver"][::std::mem::align_of::<lkPeerObserver>() - 8usize];
    ["Offset of field: lkPeerObserver::onSignalingChange"]
        [::std::mem::offset_of!(lkPeerObserver, onSignalingChange) - 0usize];
    ["Offset of field: lkPeerObserver::onIceCandidate"]
        [::std::mem::offset_of!(lkPeerObserver, onIceCandidate) - 8usize];
    ["Offset of field: lkPeerObserver::onDataChannel"]
        [::std::mem::offset_of!(lkPeerObserver, onDataChannel) - 16usize];
    ["Offset of field: lkPeerObserver::onTrack"]
        [::std::mem::offset_of!(lkPeerObserver, onTrack) - 24usize];
    ["Offset of field: lkPeerObserver::onConnectionChange"]
        [::std::mem::offset_of!(lkPeerObserver, onConnectionChange) - 32usize];
    ["Offset of field: lkPeerObserver::onIceCandidateError"]
        [::std::mem::offset_of!(lkPeerObserver, onIceCandidateError) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkDataChannelObserver {
    pub onStateChange: ::std::option::Option<
        unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void, state: lkDcState),
    >,
    pub onMessage: ::std::option::Option<
        unsafe extern "C" fn(
            data: *const u8,
            size: u64,
            binary: bool,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onBufferedAmountChange: ::std::option::Option<
        unsafe extern "C" fn(sentDataSize: u64, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkDataChannelObserver"][::std::mem::size_of::<lkDataChannelObserver>() - 24usize];
    ["Alignment of lkDataChannelObserver"]
        [::std::mem::align_of::<lkDataChannelObserver>() - 8usize];
    ["Offset of field: lkDataChannelObserver::onStateChange"]
        [::std::mem::offset_of!(lkDataChannelObserver, onStateChange) - 0usize];
    ["Offset of field: lkDataChannelObserver::onMessage"]
        [::std::mem::offset_of!(lkDataChannelObserver, onMessage) - 8usize];
    ["Offset of field: lkDataChannelObserver::onBufferedAmountChange"]
        [::std::mem::offset_of!(lkDataChannelObserver, onBufferedAmountChange) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkIceServer {
    pub urls: *mut *const ::std::os::raw::c_char,
    pub urlsCount: ::std::os::raw::c_int,
    pub username: *const ::std::os::raw::c_char,
    pub password: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkIceServer"][::std::mem::size_of::<lkIceServer>() - 32usize];
    ["Alignment of lkIceServer"][::std::mem::align_of::<lkIceServer>() - 8usize];
    ["Offset of field: lkIceServer::urls"][::std::mem::offset_of!(lkIceServer, urls) - 0usize];
    ["Offset of field: lkIceServer::urlsCount"]
        [::std::mem::offset_of!(lkIceServer, urlsCount) - 8usize];
    ["Offset of field: lkIceServer::username"]
        [::std::mem::offset_of!(lkIceServer, username) - 16usize];
    ["Offset of field: lkIceServer::password"]
        [::std::mem::offset_of!(lkIceServer, password) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkRtcConfiguration {
    pub iceServers: *mut lkIceServer,
    pub iceServersCount: ::std::os::raw::c_int,
    pub iceTransportType: lkIceTransportType,
    pub gatheringPolicy: lkContinualGatheringPolicy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkRtcConfiguration"][::std::mem::size_of::<lkRtcConfiguration>() - 24usize];
    ["Alignment of lkRtcConfiguration"][::std::mem::align_of::<lkRtcConfiguration>() - 8usize];
    ["Offset of field: lkRtcConfiguration::iceServers"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceServers) - 0usize];
    ["Offset of field: lkRtcConfiguration::iceServersCount"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceServersCount) - 8usize];
    ["Offset of field: lkRtcConfiguration::iceTransportType"]
        [::std::mem::offset_of!(lkRtcConfiguration, iceTransportType) - 12usize];
    ["Offset of field: lkRtcConfiguration::gatheringPolicy"]
        [::std::mem::offset_of!(lkRtcConfiguration, gatheringPolicy) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkDataChannelInit {
    pub reliable: bool,
    pub ordered: bool,
    pub maxRetransmits: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkDataChannelInit"][::std::mem::size_of::<lkDataChannelInit>() - 8usize];
    ["Alignment of lkDataChannelInit"][::std::mem::align_of::<lkDataChannelInit>() - 4usize];
    ["Offset of field: lkDataChannelInit::reliable"]
        [::std::mem::offset_of!(lkDataChannelInit, reliable) - 0usize];
    ["Offset of field: lkDataChannelInit::ordered"]
        [::std::mem::offset_of!(lkDataChannelInit, ordered) - 1usize];
    ["Offset of field: lkDataChannelInit::maxRetransmits"]
        [::std::mem::offset_of!(lkDataChannelInit, maxRetransmits) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkRtcError {
    pub message: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkRtcError"][::std::mem::size_of::<lkRtcError>() - 8usize];
    ["Alignment of lkRtcError"][::std::mem::align_of::<lkRtcError>() - 8usize];
    ["Offset of field: lkRtcError::message"][::std::mem::offset_of!(lkRtcError, message) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkStringOut {
    pub buf: *const ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkStringOut"][::std::mem::size_of::<lkStringOut>() - 16usize];
    ["Alignment of lkStringOut"][::std::mem::align_of::<lkStringOut>() - 8usize];
    ["Offset of field: lkStringOut::buf"][::std::mem::offset_of!(lkStringOut, buf) - 0usize];
    ["Offset of field: lkStringOut::length"][::std::mem::offset_of!(lkStringOut, length) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkSetSdpObserver {
    pub onSuccess:
        ::std::option::Option<unsafe extern "C" fn(userdata: *mut ::std::os::raw::c_void)>,
    pub onFailure: ::std::option::Option<
        unsafe extern "C" fn(error: *const lkRtcError, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkSetSdpObserver"][::std::mem::size_of::<lkSetSdpObserver>() - 16usize];
    ["Alignment of lkSetSdpObserver"][::std::mem::align_of::<lkSetSdpObserver>() - 8usize];
    ["Offset of field: lkSetSdpObserver::onSuccess"]
        [::std::mem::offset_of!(lkSetSdpObserver, onSuccess) - 0usize];
    ["Offset of field: lkSetSdpObserver::onFailure"]
        [::std::mem::offset_of!(lkSetSdpObserver, onFailure) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkCreateSdpObserver {
    pub onSuccess: ::std::option::Option<
        unsafe extern "C" fn(
            desc: *mut lkSessionDescription,
            userdata: *mut ::std::os::raw::c_void,
        ),
    >,
    pub onFailure: ::std::option::Option<
        unsafe extern "C" fn(error: *const lkRtcError, userdata: *mut ::std::os::raw::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkCreateSdpObserver"][::std::mem::size_of::<lkCreateSdpObserver>() - 16usize];
    ["Alignment of lkCreateSdpObserver"][::std::mem::align_of::<lkCreateSdpObserver>() - 8usize];
    ["Offset of field: lkCreateSdpObserver::onSuccess"]
        [::std::mem::offset_of!(lkCreateSdpObserver, onSuccess) - 0usize];
    ["Offset of field: lkCreateSdpObserver::onFailure"]
        [::std::mem::offset_of!(lkCreateSdpObserver, onFailure) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkOfferAnswerOptions {
    pub iceRestart: bool,
    pub useRtpMux: bool,
    pub offerToReceiveAudio: bool,
    pub offerToReceiveVideo: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lkOfferAnswerOptions"][::std::mem::size_of::<lkOfferAnswerOptions>() - 4usize];
    ["Alignment of lkOfferAnswerOptions"][::std::mem::align_of::<lkOfferAnswerOptions>() - 1usize];
    ["Offset of field: lkOfferAnswerOptions::iceRestart"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, iceRestart) - 0usize];
    ["Offset of field: lkOfferAnswerOptions::useRtpMux"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, useRtpMux) - 1usize];
    ["Offset of field: lkOfferAnswerOptions::offerToReceiveAudio"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, offerToReceiveAudio) - 2usize];
    ["Offset of field: lkOfferAnswerOptions::offerToReceiveVideo"]
        [::std::mem::offset_of!(lkOfferAnswerOptions, offerToReceiveVideo) - 3usize];
};
unsafe extern "C" {
    pub fn lkInitialize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkDispose() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkAddRef(rc: *mut lkRefCounted);
}
unsafe extern "C" {
    pub fn lkReleaseRef(rc: *mut lkRefCounted);
}
unsafe extern "C" {
    pub fn lkCreatePeerFactory() -> *mut lkPeerFactory;
}
unsafe extern "C" {
    pub fn lkCreatePeer(
        factory: *mut lkPeerFactory,
        config: *const lkRtcConfiguration,
        observer: *const lkPeerObserver,
        userdata: *mut ::std::os::raw::c_void,
    ) -> *mut lkPeer;
}
unsafe extern "C" {
    pub fn lkCreateDataChannel(
        peer: *mut lkPeer,
        label: *const ::std::os::raw::c_char,
        init: *const lkDataChannelInit,
    ) -> *mut lkDataChannel;
}
unsafe extern "C" {
    pub fn lkAddIceCandidate(
        peer: *mut lkPeer,
        candidate: *mut lkIceCandidate,
        onComplete: ::std::option::Option<
            unsafe extern "C" fn(error: *mut lkRtcError, userdata: *mut ::std::os::raw::c_void),
        >,
        userdata: *mut ::std::os::raw::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lkSetLocalDescription(
        peer: *mut lkPeer,
        desc: *const lkSessionDescription,
        observer: *const lkSetSdpObserver,
        userdata: *mut ::std::os::raw::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lkSetRemoteDescription(
        peer: *mut lkPeer,
        desc: *const lkSessionDescription,
        observer: *const lkSetSdpObserver,
        userdata: *mut ::std::os::raw::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lkCreateOffer(
        peer: *mut lkPeer,
        options: *const lkOfferAnswerOptions,
        observer: *const lkCreateSdpObserver,
        userdata: *mut ::std::os::raw::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lkCreateAnswer(
        peer: *mut lkPeer,
        options: *const lkOfferAnswerOptions,
        observer: *const lkCreateSdpObserver,
        userdata: *mut ::std::os::raw::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lkPeerSetConfig(peer: *mut lkPeer, config: *const lkRtcConfiguration) -> bool;
}
unsafe extern "C" {
    pub fn lkPeerClose(peer: *mut lkPeer) -> bool;
}
unsafe extern "C" {
    pub fn lkDcRegisterObserver(
        dc: *mut lkDataChannel,
        observer: *const lkDataChannelObserver,
        userdata: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn lkDcUnregisterObserver(dc: *mut lkDataChannel);
}
unsafe extern "C" {
    pub fn lkDcGetState(dc: *mut lkDataChannel) -> lkDcState;
}
unsafe extern "C" {
    pub fn lkDcGetId(dc: *mut lkDataChannel) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkDcGetLabel(
        dc: *mut lkDataChannel,
        buffer: *mut ::std::os::raw::c_char,
        bufferSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkDcGetBufferedAmount(dc: *mut lkDataChannel) -> u64;
}
unsafe extern "C" {
    pub fn lkDcSendAsync(
        dc: *mut lkDataChannel,
        data: *const u8,
        size: u64,
        binary: bool,
        onComplete: ::std::option::Option<
            unsafe extern "C" fn(error: *mut lkRtcError, userdata: *mut ::std::os::raw::c_void),
        >,
        userdata: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn lkDcClose(dc: *mut lkDataChannel);
}
unsafe extern "C" {
    pub fn lkCreateSessionDescription(
        type_: lkSdpType,
        sdp: *const ::std::os::raw::c_char,
    ) -> *mut lkSessionDescription;
}
unsafe extern "C" {
    pub fn lkSessionDescriptionGetType(desc: *mut lkSessionDescription) -> lkSdpType;
}
unsafe extern "C" {
    pub fn lkSessionDescriptionGetSdpLength(
        desc: *mut lkSessionDescription,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkSessionDescriptionGetSdp(
        desc: *mut lkSessionDescription,
        buffer: *mut ::std::os::raw::c_char,
        bufferSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkCreateIceCandidate(
        mid: *const ::std::os::raw::c_char,
        mlineIndex: ::std::os::raw::c_int,
        sdp: *const ::std::os::raw::c_char,
    ) -> *mut lkIceCandidate;
}
unsafe extern "C" {
    pub fn lkIceCandidateGetMlineIndex(candidate: *mut lkIceCandidate) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkIceCandidateGetMidLength(candidate: *mut lkIceCandidate) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkIceCandidateGetMid(
        candidate: *mut lkIceCandidate,
        buffer: *mut ::std::os::raw::c_char,
        bufferSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkIceCandidateGetSdpLength(candidate: *mut lkIceCandidate) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lkIceCandidateGetSdp(
        candidate: *mut lkIceCandidate,
        buffer: *mut ::std::os::raw::c_char,
        bufferSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
