/* automatically generated by rust-bindgen 0.71.1 */

pub const SOXR_THIS_VERSION_STR: &[u8; 6] = b"0.1.3\0";
pub const SOXR_TPDF: u32 = 0;
pub const SOXR_NO_DITHER: u32 = 8;
pub const SOXR_ROLLOFF_SMALL: u32 = 0;
pub const SOXR_ROLLOFF_MEDIUM: u32 = 1;
pub const SOXR_ROLLOFF_NONE: u32 = 2;
pub const SOXR_HI_PREC_CLOCK: u32 = 8;
pub const SOXR_DOUBLE_PRECISION: u32 = 16;
pub const SOXR_VR: u32 = 32;
pub const SOXR_COEF_INTERP_AUTO: u32 = 0;
pub const SOXR_COEF_INTERP_LOW: u32 = 2;
pub const SOXR_COEF_INTERP_HIGH: u32 = 3;
pub const SOXR_QQ: u32 = 0;
pub const SOXR_LQ: u32 = 1;
pub const SOXR_MQ: u32 = 2;
pub const SOXR_16_BITQ: u32 = 3;
pub const SOXR_20_BITQ: u32 = 4;
pub const SOXR_24_BITQ: u32 = 5;
pub const SOXR_28_BITQ: u32 = 6;
pub const SOXR_32_BITQ: u32 = 7;
pub const SOXR_LSR0Q: u32 = 8;
pub const SOXR_LSR1Q: u32 = 9;
pub const SOXR_LSR2Q: u32 = 10;
pub const SOXR_LINEAR_PHASE: u32 = 0;
pub const SOXR_INTERMEDIATE_PHASE: u32 = 16;
pub const SOXR_MINIMUM_PHASE: u32 = 48;
pub const SOXR_STEEP_FILTER: u32 = 64;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type soxr_io_spec_t = soxr_io_spec;
pub type soxr_quality_spec_t = soxr_quality_spec;
pub type soxr_runtime_spec_t = soxr_runtime_spec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct soxr {
    _unused: [u8; 0],
}
pub type soxr_t = *mut soxr;
pub type soxr_error_t = *const ::std::os::raw::c_char;
pub type soxr_buf_t = *mut ::std::os::raw::c_void;
pub type soxr_cbuf_t = *const ::std::os::raw::c_void;
pub type soxr_bufs_t = *const soxr_buf_t;
pub type soxr_cbufs_t = *const soxr_cbuf_t;
pub type soxr_in_t = *const ::std::os::raw::c_void;
pub type soxr_out_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn soxr_version() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn soxr_create(
        input_rate: f64,
        output_rate: f64,
        num_channels: ::std::os::raw::c_uint,
        arg1: *mut soxr_error_t,
        arg2: *const soxr_io_spec_t,
        arg3: *const soxr_quality_spec_t,
        arg4: *const soxr_runtime_spec_t,
    ) -> soxr_t;
}
unsafe extern "C" {
    pub fn soxr_process(
        resampler: soxr_t,
        in_: soxr_in_t,
        ilen: usize,
        idone: *mut usize,
        out: soxr_out_t,
        olen: usize,
        odone: *mut usize,
    ) -> soxr_error_t;
}
pub type soxr_input_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        input_fn_state: *mut ::std::os::raw::c_void,
        data: *mut soxr_in_t,
        requested_len: usize,
    ) -> usize,
>;
unsafe extern "C" {
    pub fn soxr_set_input_fn(
        resampler: soxr_t,
        arg1: soxr_input_fn_t,
        input_fn_state: *mut ::std::os::raw::c_void,
        max_ilen: usize,
    ) -> soxr_error_t;
}
unsafe extern "C" {
    pub fn soxr_output(resampler: soxr_t, data: soxr_out_t, olen: usize) -> usize;
}
unsafe extern "C" {
    pub fn soxr_error(arg1: soxr_t) -> soxr_error_t;
}
unsafe extern "C" {
    pub fn soxr_num_clips(arg1: soxr_t) -> *mut usize;
}
unsafe extern "C" {
    pub fn soxr_delay(arg1: soxr_t) -> f64;
}
unsafe extern "C" {
    pub fn soxr_engine(arg1: soxr_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn soxr_clear(arg1: soxr_t) -> soxr_error_t;
}
unsafe extern "C" {
    pub fn soxr_delete(arg1: soxr_t);
}
unsafe extern "C" {
    pub fn soxr_oneshot(
        input_rate: f64,
        output_rate: f64,
        num_channels: ::std::os::raw::c_uint,
        in_: soxr_in_t,
        ilen: usize,
        idone: *mut usize,
        out: soxr_out_t,
        olen: usize,
        odone: *mut usize,
        arg1: *const soxr_io_spec_t,
        arg2: *const soxr_quality_spec_t,
        arg3: *const soxr_runtime_spec_t,
    ) -> soxr_error_t;
}
unsafe extern "C" {
    pub fn soxr_set_io_ratio(arg1: soxr_t, io_ratio: f64, slew_len: usize) -> soxr_error_t;
}
pub const soxr_datatype_t_SOXR_FLOAT32: soxr_datatype_t = 0;
pub const soxr_datatype_t_SOXR_FLOAT64: soxr_datatype_t = 1;
pub const soxr_datatype_t_SOXR_INT32: soxr_datatype_t = 2;
pub const soxr_datatype_t_SOXR_INT16: soxr_datatype_t = 3;
pub const soxr_datatype_t_SOXR_SPLIT: soxr_datatype_t = 4;
pub const soxr_datatype_t_SOXR_FLOAT32_I: soxr_datatype_t = 0;
pub const soxr_datatype_t_SOXR_FLOAT64_I: soxr_datatype_t = 1;
pub const soxr_datatype_t_SOXR_INT32_I: soxr_datatype_t = 2;
pub const soxr_datatype_t_SOXR_INT16_I: soxr_datatype_t = 3;
pub const soxr_datatype_t_SOXR_FLOAT32_S: soxr_datatype_t = 4;
pub const soxr_datatype_t_SOXR_FLOAT64_S: soxr_datatype_t = 5;
pub const soxr_datatype_t_SOXR_INT32_S: soxr_datatype_t = 6;
pub const soxr_datatype_t_SOXR_INT16_S: soxr_datatype_t = 7;
pub type soxr_datatype_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct soxr_io_spec {
    pub itype: soxr_datatype_t,
    pub otype: soxr_datatype_t,
    pub scale: f64,
    pub e: *mut ::std::os::raw::c_void,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of soxr_io_spec"][::std::mem::size_of::<soxr_io_spec>() - 32usize];
    ["Alignment of soxr_io_spec"][::std::mem::align_of::<soxr_io_spec>() - 8usize];
    ["Offset of field: soxr_io_spec::itype"][::std::mem::offset_of!(soxr_io_spec, itype) - 0usize];
    ["Offset of field: soxr_io_spec::otype"][::std::mem::offset_of!(soxr_io_spec, otype) - 4usize];
    ["Offset of field: soxr_io_spec::scale"][::std::mem::offset_of!(soxr_io_spec, scale) - 8usize];
    ["Offset of field: soxr_io_spec::e"][::std::mem::offset_of!(soxr_io_spec, e) - 16usize];
    ["Offset of field: soxr_io_spec::flags"][::std::mem::offset_of!(soxr_io_spec, flags) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct soxr_quality_spec {
    pub precision: f64,
    pub phase_response: f64,
    pub passband_end: f64,
    pub stopband_begin: f64,
    pub e: *mut ::std::os::raw::c_void,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of soxr_quality_spec"][::std::mem::size_of::<soxr_quality_spec>() - 48usize];
    ["Alignment of soxr_quality_spec"][::std::mem::align_of::<soxr_quality_spec>() - 8usize];
    ["Offset of field: soxr_quality_spec::precision"]
        [::std::mem::offset_of!(soxr_quality_spec, precision) - 0usize];
    ["Offset of field: soxr_quality_spec::phase_response"]
        [::std::mem::offset_of!(soxr_quality_spec, phase_response) - 8usize];
    ["Offset of field: soxr_quality_spec::passband_end"]
        [::std::mem::offset_of!(soxr_quality_spec, passband_end) - 16usize];
    ["Offset of field: soxr_quality_spec::stopband_begin"]
        [::std::mem::offset_of!(soxr_quality_spec, stopband_begin) - 24usize];
    ["Offset of field: soxr_quality_spec::e"]
        [::std::mem::offset_of!(soxr_quality_spec, e) - 32usize];
    ["Offset of field: soxr_quality_spec::flags"]
        [::std::mem::offset_of!(soxr_quality_spec, flags) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct soxr_runtime_spec {
    pub log2_min_dft_size: ::std::os::raw::c_uint,
    pub log2_large_dft_size: ::std::os::raw::c_uint,
    pub coef_size_kbytes: ::std::os::raw::c_uint,
    pub num_threads: ::std::os::raw::c_uint,
    pub e: *mut ::std::os::raw::c_void,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of soxr_runtime_spec"][::std::mem::size_of::<soxr_runtime_spec>() - 32usize];
    ["Alignment of soxr_runtime_spec"][::std::mem::align_of::<soxr_runtime_spec>() - 8usize];
    ["Offset of field: soxr_runtime_spec::log2_min_dft_size"]
        [::std::mem::offset_of!(soxr_runtime_spec, log2_min_dft_size) - 0usize];
    ["Offset of field: soxr_runtime_spec::log2_large_dft_size"]
        [::std::mem::offset_of!(soxr_runtime_spec, log2_large_dft_size) - 4usize];
    ["Offset of field: soxr_runtime_spec::coef_size_kbytes"]
        [::std::mem::offset_of!(soxr_runtime_spec, coef_size_kbytes) - 8usize];
    ["Offset of field: soxr_runtime_spec::num_threads"]
        [::std::mem::offset_of!(soxr_runtime_spec, num_threads) - 12usize];
    ["Offset of field: soxr_runtime_spec::e"]
        [::std::mem::offset_of!(soxr_runtime_spec, e) - 16usize];
    ["Offset of field: soxr_runtime_spec::flags"]
        [::std::mem::offset_of!(soxr_runtime_spec, flags) - 24usize];
};
unsafe extern "C" {
    pub fn soxr_quality_spec(
        recipe: ::std::os::raw::c_ulong,
        flags: ::std::os::raw::c_ulong,
    ) -> soxr_quality_spec_t;
}
unsafe extern "C" {
    pub fn soxr_runtime_spec(num_threads: ::std::os::raw::c_uint) -> soxr_runtime_spec_t;
}
unsafe extern "C" {
    pub fn soxr_io_spec(itype: soxr_datatype_t, otype: soxr_datatype_t) -> soxr_io_spec_t;
}
unsafe extern "C" {
    pub fn soxr_set_error(arg1: soxr_t, arg2: soxr_error_t) -> soxr_error_t;
}
unsafe extern "C" {
    pub fn soxr_set_num_channels(arg1: soxr_t, arg2: ::std::os::raw::c_uint) -> soxr_error_t;
}
